Revit 2026 API

# WireSizeSize Property

---

Get size symbol of wire.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Size { get; }
```
```vb
Public ReadOnly Property Size As String
	Get
```
```cpp
public:
property String^ Size {
	String^ get ();
}
```
```fsharp
member Size : string with get
```

#### Property Value

String

#### Reference

WireSize Class

Autodesk.Revit.DB.Electrical Namespace